作业讲解
    1,字体大小小于16像素的时候,如果标签本身设置了字体大小那么父级容器的大小将保留在字体为16像素时候的大小
    解决办法:
        1)直接给父容器设置字体大小,不要给里面的标签单独设置
        2)单独设置line-height

    快捷键:h100+tab键,自动生成(高100px)
          :ctrl+g键,快速定位行数
          : bg+ +tab键,背景简写
    其他符号:||    或者


一、样式表的书写位置
   1,内嵌式(内部式,写在html文件内),控制当前页面
     1)所有的css写在style标签内
     优:方便 基本实现样式结构分离
     缺:没有完全分离

   2,外链式(外部式,直接在css里面写选择器\属性\值),控制整个网站
      1)一个css文件
      2)link标签+html文件实现
      优:完全实现样式结构分离
      缺:需载入一次

   3,行内式(将css作为标签属性style写在html文件内),控制当前标签内部
      优:权重最高
      缺:没有实现分离
   后续js操作css都是行内式操作!!


  权重:行内最高.外链和内嵌权重一样,后渲染的起作用.

二、标签的三种渲染模式
   1,块级标签(块级元素）div,h,p,ol,ul,li,dl,dt,dd,header,footer,nav,aside,article,section
   特点:1)可以直接写宽高 
        2)独占一行
        3)默认宽度是父级标签的宽度
        4)一般这种标签作为容器布局,可以嵌套其他块级元素或行内元素
           注意:p标签不要包裹其他块级元素
        


   2,行内标签(行内元素),strong,a,span,em,del,ins
   特点:1)设置宽高没有作用
        2)一行内允许多个行内元素
        3)默认宽度为内容的宽度,无内容就没有大小
        4)一般用来包裹文字,或者做一些小的装饰
        注意:行内元素不要包裹块级元素,a标签除外(手机端例子)
   3,特殊的行内元素,行内块,img,input
   特点:1)可以写宽高
        2)一行内允许多个行内元素
        3)行内块元素可以受
             text-align,
             line-height文字元素的控制,不能控制图片垂直居中(后期会讲).
          注意:text-align属性要写在盒子内,不能写在img内,img相当于盒子内的文字,内容
    4,标签之间的相互转换display
    属性:display
      值:1)inline转换成行内元素
         2)block转换成块级元素
         3)inline-block转换成行内块元素



三、复合选择器
定义:有多种基本选择器组合而成的选择器,用于满足复杂需求

    1,交集选择器      选择器1选择器2 {}
      原则:既又原则(直接写,不加空格)
       eg: div.box      选择既是div标签又有class="box"的元素
           .box#green   选择既是class="box"又是id="grenn"的元素

    2,并集选择器      选择器1,选择器2,选择器3,... {}
       原则:和(用逗号隔开)
       eg:p,div,h1           选择p和div和h1三个元素
          .box,.sb    选择class="box"和id="sb"的元素


    3,后代选择器:       选择器1 选择器2 {}
       原则:父级 后代(用空格隔开)选择器关系为包含关系
       eg:.box .red       选择父级为class="box"属性下面的后代为class="red"元素


    4,子代选择器:        选择器1 > 选择器2 {}  效率高于后代选择器
       原则:必须满足父子关系(中间用>关联)  只能选择父级下面的子级
       eg:.box>.red       选择父级为class="box"属性下面的子代为class="red"元素

四、背景属性
    是一个复合属性


    1,背景颜色background-color:(值);
    快捷键:bgc+tab
        值:英文,十六进制,rgb,rgba
    2,背景图片background-image:url(路径);
    路径不能有中文名,有中文名会出现乱码.
    如果要打开:把图片用浏览器打开,复制带协议的路径即可(浏览器自动生成不带中文的地址)



    3,背景平铺background-repeat:(值);
    值:1)no-repeat  不平铺
       2)repeat     平铺
       3)repeat-x   x轴平铺(水平平铺)
       4)repeat-y   y轴平铺(垂直平铺)


    4,背景是否跟随滚动background-attachment
    值:1)scroll   滚动
       2)fixed    固定


    5,背景位置background-position
    值:1)方位名词   left  ringht  center top bottom顺序随意
       2)像素   100px 100px(向右100像素,向下100像素)
       程序里的坐标系,x轴向右,y轴向下,允许负值
       顺序为:x轴,y轴.
       3)百分比  80% 20%(向右走盒子的80%,向左走图片的80%,向下走盒子的20%,向上走图片的20%
       顺序为:x轴,y轴.
       4)混写   right 100px
       顺序为:x轴,y轴.
    简写:快捷键 bg+   +tab键
    background:{颜色 地址 平铺 滚动 位置}顺序随意,空格连接



五、背景图片和img的区别
   1)img工作中一般用于引入产品图(后台维护简单,时常更新)
     background工作中一般用于加载一些小图片或者小icon或者一些不变的图片或者超大的图片

   2)如果有文字,文字可以显示在背景图片上,但不能显示在img上(目前的不行,需要后期用定位)
   3)img图片不需要添加宽高
     background图片默认撑不开容器,容器本身需要宽高方可显示
   4)img设置图片的居中用margin
     背景图片用background-position


六、css的三大特性
   1,继承性    后代元素可以继承祖先的一些css样式
     可以继承的属性:跟文字相关的(color,font,text,line)
     注意:1)块级元素会继承父级的宽度,高度不继承
          2)a链接颜色,text-decoration继承的不渲染,需要设置,因为它本身有颜色,自己自带的颜色权重高.
          3)权重,如果元素自身有对应的属性,那么继承过来的相同元素的属性不渲染.

   2,层叠性   权重相同的情况下,后渲染的覆盖掉先渲染的,后渲染的出效果

   调用类的


   3,权重性   权重重的出效果会被渲染

   继承<通配符<标签选择器<类选择器 < id选择器<行内< !important






