一、尚合项目讲解细节
    1,input,button {border:none;}input和button默认有2px的边框,所以先去掉.
    2, button高度
       css3:box-sizing border-box,如果添加了padding和margin会默认减掉
    3,视图:清除切片
    4,加粗可用strong,加强语义,
    5,.item:nth-child(1)(选中第一个子元素为class="item")
    6,shift+方向键,快速移动切片区域



二、定位(属性positon)
	1)定位的方式:静态,相对,绝对,固定
	2)偏移值left,right,top,bottom:距离什么方位的偏移位置有多大



1,值:static静态定位(所有的标准流都是静态定位)
	(1)偏移位置对于静态定位不起作用
	(2)一般用在将已经做了其他定位的元素在某种情况下回归标准流,配合js使用较多

2,值:relative相对定位
	(1)相对于自己原本的位置,进行移动
	(2)相对定位没有脱标,并且它原先在标准流的位置还是原来的位置(肉体不在灵魂永驻)
	(4)可以盖在标准流的上方
	(5)一般用于微调元素和配合绝对定位来使用

3,值:absolute绝对定位
	(1)需要绝对定位的元素,会一直往上级找,直到找到被定位过的元素(绝对,相对,固定三者中的任何一个),以此为参照进行移动.如果一直找不到,会一直找到最大的html标签
	(2)脱离标准流
	   1)不占标准流位置,
	   2)不继承父级的宽度,内容有多大就撑多大,可以设宽高,不论前身是块还是行内元素,都会变成定位元素
	   3)margin,auto对定位不起作用(margin+值有作用的)
实际工作中使用最多的定位口诀:父相子绝
	(3)其他拓展
		1)让一个绝对定位水平居中:
	  		eg:   position:absolute;
	  				 left:50%;
	  				 top:50%;
	  				 margin-left:-(自身盒子尺寸的一半)px;
	  				 margin-top:-(自身盒子尺寸的一半)px;
	  	2)轮播图静态布局:
	  		详细看课堂练习


4,值:fixed固定定位
	(1)永远参照浏览器的窗口为定位值,俗语:浏览器的滚动条对它不起作用.
	(2)特性,不占标准流的位置等等和其他定位一样.


三、属性:z-index
1,控制定位(相对,固定,绝对)元素的层级性
	层级越大的,显示在最上面
   1)值:数字       数字越大,层级越大
   2)值:auto       就是0
2,特殊用法
	父级先比较过z-index(指父级都有z-index,且值不为auto),那么子元素里面的z-index没有作用.


四、其他
p{文字内容$}*100
生成1-100个p里写着文字内


ps导出透明的图层,能切90%以上的透明图层 
	1,在v选择工具下,按住ctrl,鼠标单击
	2,图层面板下,右键转换为智能对象
	3,在缩略图上双击,点击确认.
	4,三键＋s,保存