一,php课程目的
  1,熟悉了解后端的工作流程,有利于前后端交互
  2,注意:php后缀的文件,文件名和文件路径不得有中文
二,服务器(Server)
    定义:可以提供服务的机器
    专业服务器优点:
        1)性能好
        2)7*24小时不断运行
        3)价格高昂
    分类:
        1)文件服务器
        2)邮件服务器
        3)web服务器(http服务器) 提供的是web服务(听歌,看网页,看视频等等)
        4)游戏服务器
        5)...
    需要安装对应的服务器软件才能提供对应的服务
    常见的服务器软件:
        1)IIS  windows服务器,跨平台不好
        2)apache 服务器(开源,免费,跨平台性很好)
        3)nginx  服务器,上手难度大
        4).....
三,客户端(Client)
定义:就是一个安装了客户端软件的电脑,可以向服务器索取服务
客户端向服务器发送请求(索取服务);服务器向客户端提供服务(进行响应)
CS架构:Client(客户端) 服务器(Server)
      特点:
      1)需要下载对应客户端才能索取服务
      2)不同客户端下载需要耗费不同的时间
      优点:稳定,性能显示效果非常好,用户体验好
      缺点:
      1)开发时需要开发不同的版本,维护不同的版本(成本高)
      2)时不时让用户进行下载更新,更新维护麻烦
      3)跨平台不好,需要对应不同的系统开发不同的版本
BS架构:Browser(浏览器) 服务器(Server)
      优点:
      1)不需要下载客户端
      2)页面更新方便
      3)跨平台性好
      缺点:不太稳定,依赖网络,性能效果相对来说较差
四,环境搭建
    1,安装phpstudy(是一个集成环境,集成apache mysql php)
    2,更改网页根目录
    3,查看自己的ip地址:  window+R打开命令,输入cmd,输入ipconfig
    4,可以通过ip地址进行访问
五,网站
部署网站:将做好的网页放到www中,外面的电脑就可以通过服务器访问到公开在www的内容;
        放进去的页面,默认会打开index的html文件,如果index1则打开的是目录形式的,不是网页形式的
六,web访问的基础流程
    1,自己的电脑可以成为服务器,安装了对应的服务器软件
    2,将网站部署到了服务器上(将网页拷贝到对应的www网站根目录)
    3,自己的电脑通过ip地址向服务器(同桌的电脑)发起请求,默认访问www目录index.html文件;
        如果没有index以目录/列表的形式展示;
        服务器服务(进行响应)
    4,ip地址/文件路径     访问的是指定的路径,不会访问index
    5,如果www根目录下有很多网站,分不同的路径;访问的时候,默认访问根目录,打开的是文件夹,所以开发的时候可以这样使用
    6,本地回环地址:
       为了方便开发,实现自己访问自己的测试;
       本地回环地址:127.0.0.1(自己访问自己);
       localhost(域名)可以映射到127.0.0.1
七,动态网站和静态网站
    1,静态网站
    定义:由html,css,js组成,只要不进行修改,不会发生改变
    2,动态网站
    定义:随着用户访问时机不同,用户的不同等等,进行动态生成网页
    通过后台数据库提供的数据进行动态生成
    1)可以生成动态网页的语言:java php python c# node go
    php的优点: 
      1)和js的语法类似,上手较快;
      2)只要你能想到的功能php中都提供了对应的内置函数(4k多个函数)
八,网络基础
1,ip地址:计算机在网络上的唯一标识32位地址(像身份证号),通过ip地址可以找到计算机
    优点:唯一标识
    缺点:不好记
        在命令界面ping
        ping www.baidu.com 可以打印解析过程,将ip地址解析出来,外网的ip地址不同
        通过ping 可以查看与服务器的链接是否连通
2,域名:给ip地址起了个好记的名字,用来代替ip地址
    特殊域名:localhost 本机的域名
3,DNS服务器 域名解析服务器
    定义:提供域名和ip地址解析的服务,存着ip地址和域名的对应关系
4,本地hosts文件
    本地hosts文件也记录了ip和域名的关系
    域名解析优先级:
    先进行询问本机hosts文件,找不到再询问DNS服务器
    修改:  C:\Windows\System32\drivers\etc目录下有个一个HOSTS文件,用编辑器(sublime)打开 
    用apache服务器如果不是php文件,会有很大的缓存,所以用ctrl +F5 强制刷新
5,端口
    端口可以定位具体是哪个应用程序处理服务器的消息,不同端口可以提供不同的服务,通过端口定位对应不同的应用软件
    可以写死,也可以自动分配
        80是默认端口
        443的端口是https
        3306端口是数据库的mysql
        21端口是ftp
九,php基础-初体验
    开源的,跨平台性很好 
    web开发环境的集成环境两种分类:
        WAMP:windows apache mysql php 
        LAMP:Linux apache mysql php 
    1,文件以php结尾
    2,<?php php代码 ?>
    3,php中的注释和js中的注释一样
    4,所有的php代码都要用php标签包裹<?php?>
    5,echo输出的内容,测试打印
    6,必须以服务器的方式访问php文件,php代码才会执行
    7,服务器会对php代码进行解析执行,并将结果输出给浏览器
    8,注释不会输出
    9,php中需要指定字符集 header('content-type:text/html;charset=utf-8');可以用代码块实现
    10,php中必须以封号结尾,最后一个可以省略
十, 服务器文件
    1,普通的html格式的,html不解析,直接将文件返回
    2, php的文件,会对php文件进行解析,将输出的内容返回给浏览器
十一,变量
    1,变量  php中不用申明变量,变量在第一次进行赋值时创建
    2,变量命名方式:  变量以$开头
    3,命名开头:不能以数字开头,由字母,数字,下划线组成
    注意:如果文件名中有中文,报错提示:failed to open stream ,报错 line 0
    4,变量要赋值才能使用,为赋值的变量会报错undefined
    5,变量如果没有赋值,直接使用会报错,变量相关的方法
      1) isset(变量)    判断变量是否进行了赋值
          如果变量未赋值,或者值为null 返回false;否则返回true
      2) empty(变量)     判断变量是否为空
          如果变量未赋值,或者值为0,'','0',null,false,[]  认为为空,返回true;否则返回false
      3) unset(变量)    删除变量
      可以释放一些不需要使用的变量,帮助优化系统
引申:js中有个垃圾回收机制
js中释放变量:    var obj = {};   obj = null; 
    当复杂数据类型,没有地址指向这个空间,会被垃圾回收机制回收掉
十二,数据类型
php是弱类型语言:只需要对变量重新赋值就可以改变原来的值,互相可以随意覆盖
1,简单数据类型
  1)整数和浮点数(小数)  运算可以用+加法的意思
  2)字符串
    注意:
    (1)字符串''和""都可以进行字符串赋值
    (2)字符串拼接用.   eg:  字符串1.字符串2(不是用+)
    (3)""会解析变量   
      eg:   $str = '鹏鹏'
         echo "$str 哈哈"   输出结果:鹏鹏哈哈
         echo '$str 哈哈'   输出结果:$str哈哈
    (4)单引号的性能高,不会解析变量
  3)bool类型   
      注意: true 输出 1  ;  false输出 空字符串
  4)null
2,复杂数据类型
  1)数组
    (1)索引数组(和js的数组类似)
    可以通过array()和[]申明
    eg:
       $arr = array(1,2,3);
       $arr = [1,2,3];
      特点:
      1, 通过下标存储数据    获取单个数组:  echo 数组名[下标]
      2, 获取数组长度   count(数组名)  专门用于获取数组的长度   eg: echo count(数组名)
    (2)关联数组 (js中的对象很类似)
    可以通过array()和[]申明
      eg:  
      $arr = array(
        '名' => '值',
        '名' => '值',
        '名' => '值',
        ...
      )
      特点:
       1,通过键值对存储数据,键值对连接符 =>
       2,通过count统计数组长度
       3,关联数组如果要取值出来只能取出键值对的名,才能取到  eg:  $arr['名']   返回值是  值
    (3)二维数组
    eg: $arr = [
          [1,2,3],
          [4,5,6]
          ];
    取出数组   $arr[下标][下标]
  应用场景:
  一维关联数组,可以存储一个人的信息
  二维数组,可以存储一个班的信息
  遍历数组:
  (1)索引数组用for遍历  和js中for循环遍历一样
  (2)关联数组遍历
      foreach(数组名 as 键 =>值){
        执行体;
      }
  2)对象
  在php及其他高级语言中都有类的概念,表示一类对象,与js中构造函数类似
  eg:  
      class Person{
        public $name=>'zs',//公有数据
        public $age=>18,
        private $sex=>'男',//私有数据
      }
      调用: $p = new Person;/new Person(),小括号可写可不写
      取值:     echo $p -> name  只能取出公有数据,语法:  通过->访问对象的值(记忆)
  3)函数
    (1)可以设置默认值,默认值写在形参后面,用=号连接
    (2)不区分大小写
      eg:
      //声明 
        function sayHi($name='默认值'){
        echo $name.'说话';
      }
      //调用
        sayHi('实参');如果未传参,可以用默认值
3,输出语句:
  (1)echo 只能输出简单数据类型(对bool类型true输出1,false输出'')
  (2) print_r(变量名) 可以打印复杂数据类型
  (3) var_dump(变量名) 可以输出变量的详细信息(包括变量的类型和长度)
     注意:php中,utf-8编码的,一个中文占3个字节
十二,语句
  判断语句
  循环语句
十三,常量
变量:可以改变的数据类型
常量:不可以修改的数据类型
常量的定义:
   define('常量名',常量值);
   行内规范:常量名一般全部大写
eg:  define('PI',3.1415926)
输出:   echo PI;  如果没有加$默认是常量,如果全局都找不到就报错
特点:
    1)不能修改
    2)不能重复定义
    3)不能删除,不能用unset删除
十四,内置函数
1,数学函数
    js中 Math.max(实参)
    php中 max(实参)就可以了
  1)max(实参,实参,实参)求最大值
  可以通过传值调用,实参支持传数组,可以传字符串,字符串默认是0,如果两个参数一样大,默认返回第一个
  2)abs(实参) 求绝对值
  3)floor(实参) 向下取整
  4)ceil(实参)  向上取整
  5)round(实参)  四舍五入
  6)rand(10,100) 随机整数,从10开始到100结束里面的随机整数,包括10和100
2,日期函数
  1)time()返回当前的时间戳(1970年到当前的时间戳,秒数)
  2)date(时间格式,时间戳)格式化当前的时间默认按照零时区,我们是东八区,所以会相差8个小时
      eg: 
      $now = time();
      //'Y-m-d H:i:s' '年-月-日 时-分-秒'
      date('Y年m月d日 H时i分s秒',$now)
    配置东八区的时间
3,字符串函数
  1)str_replace(查找的值,替换的值,执行操作的字符)字符串替换(记忆)
   eg: str_replace('香蕉','**',$str)
  2)trim(执行操作的字符)去除首尾空格
  3)explode(分割符,执行操作的字符)使用一个字符串分割另外一个字符串,得到一个数组,和js中的split(记忆)
  4)implode(拼接符,执行操作的字符)将数组拼接成字符串,得到一个字符串,类似于js中的join(记忆)
  5)substr(执行操作的字符,启始索引,截取长度)字符串截取,不会改变原来的字符串;
    注意:中文占3个字节,如果截取的长度不对会乱码
  6)strchr(字符串,标识字符),从左往右查找标识字符,返回该字符后面的全部字符(包括该字符)
  eg:  
  $str = 'www.baidu.com'  ;
  strchr($str,'.')  返回值是.baidu.com
  7)strrchr(字符串,标识字符),从右往左查找标识字符,返回该字符后面的全部字符(包括该字符)(记忆)
    注意:  
    $str = 'www.baidu.com'  ;
  strrchr($str,'.')  返回值是.com
    作用:用于上传文件,获取扩展名用的



