一,初体验
   1,方法:   show(时间) 让元素显示;时间,动画的时长/ms;text() 设置文字内容;
注意:(1)需要先引入js库的文件(也称引包)
    (2) $('css选择器'),这是css选择器,需要#或者.正常的css选择器
二,jQuery
    定义:简单高效的js库
         js库:其实就是一个js文件,把平时需要常用的功能封装到一个js文件中
              需要使用功能的时候,引入这个js文件
    版本:   1.X版 :功能丰富,主要用来兼容ie低版本
            2.X版 :功能丰富,不兼容ie低版本,和1.X版本功能一样;我们学习的是1.12.4,这是1.X的最新版
            3.X版 :功能丰富,不兼容ie低版本,和2.X版本上更新的,新增api
    压缩版和开发环境版:
          带min :压缩版,主要去掉了换行,注释,使用代码混淆,主要在线上开发中使用,网页加载起来更快
          不带min:没有压缩.主要在开发,学习阶段使用,学习源码
    使用目的:提升开发效果,主要还是兼容ie低版本
三,入口函数(推荐写jQuery的入口函数)
如果script要写在整个页面的上面,需要页面加载完后才执行js/jQ的代码
js的入口函数:如果script要写在上面,要把js代码写在window.onload = function(){js代码};
    js要整个页面加载完后执行(包括外部资源文件,图片,css,js等等)
jQuery的入口函数:
    jQuery的入口函数是网页加载完成(不包括外部资源文件,图片,css,js等等)后执行,先于js入口函数执行
    写法一:
        $(document).ready(function(){jQuery代码/js代码})
    写法二:
        $(function(){jQuery代码/js代码})
四,总结jQuery的使用步骤
    1,引入jQ这个js库
    2,一定要写上入口函数
    3,在入口函数里面实现功能,代码写在入口函数内,形成局部作用域,防止全局变量污染
五,DOM对象和jQ对象
    1,   DOM对象:通过原生js方法获取到的元素就是DOM对象,eg:   document.getElementId.... 
              引申:   console.dir() 把对象展开,查看对象的方法等.
              DOM对象只能使用DOM对象本身的属性和方法,不能使用jq提供的方法
    2,   jQ对象:通过jQuery提供的$()方法获取到的元素就是jQ对象
                是一个伪数组,伪数组里面以下标的形式存储获取到的所有DOM对象
              引申:伪数组,如函数中的Arguments,可以将外部传入函数的实参当做对象,保存在伪数组中
                  jQ对象只能使用jQ对象提供的方法,不能使用DOM对象的方法
    3,  互相转换
    DOM对象转换成jQ对象
     把DOM对象作为参数传递到$()
       结构:     $(DOM对象) 
    jQ对象转换成DOM对象,使用DOM对象的方法和属性
        (1) 以下标的形式取出对应的DOM对象 (推荐使用)
        结构:     $(DOM对象)[下标]   取出来的只有对应的这一项
        (2) 用get()     (最后的底层的实现还是方法一)
        结构:      $(DOM对象).get(下标)
六,详解$符号
      1,  $哪里来,jQ文件提供的
      2,  $是个函数
      3,  $的作用:   参数不同,作用不同
            (1)参数是函数       $(function(){})   入口函数
            (2)参数是选择器     $('div')          获取元素
            (3)参数是DOM对象    $(document)       DOM对象转换成jQ对象
            (4)  $===jQuery返回true,jQuery也可以实现$一样的功能,注意区分大小写 

            
七,选择器
jQuery选择器很多,兼容CSS1至CSS3的选择器,还有常用的jQuery选择器,或者自己自定义的方法
1,  css选择器,同css写法
    (1)标签选择器              $('标签名')
    (2)id选择器                $('#id名')
    (3)类名选择器              $('.class名')
    (4)后代选择器              $('名 名')
    (5)子代选择器              $('名>名')
    (6)并集选择器(用,隔开)      $('名,名')
    (7)交集(连写不用隔开)      $('名名')
2, 过滤选择器
过滤选择器:一冒号开头的,后面紧跟选择器
这类选择器都需要写冒号 eg:  元素: 
    (1)   :odd          获取下标为奇数的元素    eg:  $('li:odd')     获取li里面的奇数li标签
    (2)   :even         获取下标为偶数的元素
    (3)   :first        获取第一个元素
    (4)   :last         获取最后一个元素
    (5)   :eq(index)    获取指定下标元素,index是随意的数字
3,筛选选择器(方法)
书写结构:     $('名').筛选选择器名(参数)
    (1)  children()         获取当前元素的所有子元素
        chiledren('参数')   参数是选择器,根据参数筛选出指定的子元素
    (2)  siblings()         获取当前元素的兄弟元素,但是不包含自己
        siblings('参数')     获取除了自己之外指定的兄弟元素
    (3)  find()             获取当前元素的后代元素
          find('参数')       获取当前元素指定的后代元素
    (4) parent()             获取当前元素的父元素
    (5)  next()              获取当前元素的下一个兄弟元素
    (6)  prev()              获取当前元素的上一个兄弟元素
    (7)  index()             获取元素在所有兄弟元素中的下标/索引
    (8)  eq(index)           获取指定的下标元素(推荐使用)
    (9)  get(index) 找到指定下标的元素,返回的是一个DOM对象
八,jQuery和javascript
jQuery:是一个js库,封装好的js方法
javascript:是一门编程语言,我们用来编写客户端浏览器脚本






九,案例
1,   .css('name','value')   
     设置或者获取元素的样式,name是样式名,value样式值(如果是fontsize,可以写'30px',也可以写30)
2,如果直接用this,在jQ中不可以是用,因为this是DOM对象,需要$(this)转换成jQ对象
3, hide() 隐藏;show() 显示
4,如果要注册给鼠标移入事件,需要注册给父级元素,让其中一个子元素显示;不能注册给子元素,让兄弟元素显示,因为移入兄弟元素之后,会离开注册的事件源,触发移出事件无法点击兄弟元素中的内容
5,mouseover/mouseout事件的触发,会在当前元素和其子元素上触发,会不停的触发,会影响网页的性能;
  mouseenter/mouseleave事件触发,只会在当前元素上触发
6,opactiy整个盒子的透明度(1是不透明,0是完全透明)
7,链式编程:就是通过.可以一直写下去
9,网页中,鼠标点到选中的元素,在控制台写     $0.children.length   获取当前选中元素的子元素的长度





