反馈知识点:同一个网站:域名,ip,端口号是同一个网站
一,XML和JSON
意义:如果想要在前后端传递复杂数据类型,所以需要通用的数据格式:xml,json;
二,XML 
定义:可扩展的标记语言,类似HTML,标签没有预定义,需要自定义标签;
    规范:
        1)第一行必须是版本信息
        <? xml version="1.0" encoding="utf-8" ?>
        2)必须有一个根元素(有,且有一个)
        3)标签不可有空格,不可以数字或.开头,大小写敏感
        4)不可交叉嵌套,都是双标签,如果是单标签,必须闭合
        5)属性双引号(浏览器自动修正成双引号)
        6)特殊符号要使用实体//???????
        7)注释和HTML一样
1,后台输出xml,需要指定输出格式为xml;
    header('content-type:text/xml;charset=utf-8')
2,用responseXML接收后台返回的xml格式的文本;
    会对里面的格式文本进行解析,得到一个dom对象(可以使用dom的方法)
    通过querySelectAll获取的伪数组,forEach;
    forEach(function(v,i){});v是每一项,i是下标
3,缺点:解析复杂,体积较大(使用较少)
三,JSON 
定义:是一种轻量级的数据交换格式,基于ESC规范
特点:
    1)由键值对组成,每个键值对通过,分隔,是字符串类型
    2)所有键名,必须双引号
    3)可以数组,也可以是对象格式
1,js数组/对象转JSON字符串
  JSON.stringify(参数);
  参数:js对象/数组
2,jSON字符串转换成js数组/对象 
  JSON.parse(参数);
  参数:JSON字符串;
3,php数组/对象转JSON字符串
  JSON_decode(参数1,参数2);
  参数1:php索引数组/关联数组
  参数2:true,是否转换
4,jSON字符串转换成php数组/对象 
  JSON_encode(参数);
  参数:JSON字符串;
四,封装ajax函数知识点
1,分开出来post和get的情况;
2,处理响应请求的时候,成功时候的回调函数;
    不能直接写return,如果直接写,请求发送是异步的,在执行下面代码的时候,
    异步请求未发送,此时代码已执行完,所以即使写了return,拿到的也是undefind;
    直接传入进去,直接调用即可
3,a && a()   ;
    此为简洁的判断,如果a为true,那么执行a();
    如果a为false,那么不执行a();
4,在回调函数内:执行  a( 实参) ;
  在回调函数中传入实参,会在函数处理中将实参接收到;
  并执行函数体,传递进来的实参会在外面的回调函数中解析出来
5,返回数据的类型处理
    xml:   responesXML;
    json:  JSON.pranse(responseText);
    其他:   responseText;
6,传参时候的对象
五,jQuery的ajax函数使用知识点
1,timeout 超时时间/   单位:毫秒
    定义:超过这个时间,就不要返回的数据了;
2,beforeSend 调用前的回调函数
    定义:发送ajax前会调用的函数;
    特点:如果这个函数返回的值必须是false,这次请求就不发送了;
    应用场景:用于表单校验;
3,complete  善后函数
    不管成功还是失败都会调用的函数
六,jQ中的其他方法(详细见老师的笔记)
$.post(url,callback,[dataType]);只发送post请求;
$.get可以省略type=get;只发送get请求;
七,接口化开发
案例知识点
1)正则 /^1\d{10}$/  以1开头的11位数字
2)正则表达式.test(内容)   测试内容是否符合正则表达式
3)stop(true),清空当前的动画队列;
4)delay(参数)
    可以让动画延迟几秒执行;参数是数字,单位是毫秒;
